## Concat DataFrames

In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({'city': ['mumbai','delhi','banglore'],
                               'temperatur':[32,45,30],
                                'humidity':[80,60,78]})

In [3]:
india_weather

       city  temperatur  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78

In [4]:
us_weather = pd.DataFrame({'city': ['newyork','chicago','orlando'],
                               'temperatur':[21,14,35],
                                'humidity':[68,65,75]})

In [6]:
us_weather

      city  temperatur  humidity
0  newyork          21        68
1  chicago          14        65
2  orlando          35        75

In [7]:
df = pd.concat([india_weather, us_weather])

In [8]:
df

       city  temperatur  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78
0   newyork          21        68
1   chicago          14        65
2   orlando          35        75